Revit 2025 API
Zone.Perimeter Property
Get the Perimeter of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double Perimeter { get; }
Public ReadOnly Property Perimeter As Double
	Get
public:
property double Perimeter {
	double get ();
}
member Perimeter : float with get
Property Value
Double
Remarks
This property is used to get the Perimeter of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace